class Dream {
  final String title;
  final String content;
  Dream({required this.title, required this.content});
}
final List<Dream> dreamsList = [
  Dream(title: "رؤية الأنبياء والرسل", content: "تفسير ابن سيرين: من رأى نبياً في منامه فإنه ينال شرفاً وعزة في الدنيا والآخرة، وهي بشارة بالفرج والخير العميم..."),
  Dream(title: "رؤية الكعبة المشرفة", content: "تدل رؤية الكعبة على الحج أو الصلاة أو الهداية، وهي بشارة بالخير والأمان والتمسك بالدين..."),
  Dream(title: "رؤية الماء والبحار", content: "يرمز الماء في الأحلام إلى الحياة والعلم والخصب، والماء الصافي رزق حلال، بينما الكدر قد يدل على هموم عابرة..."),
  Dream(title: "رؤية الطيران في المنام", content: "الطيران يدل على السفر أو نيل منصب عالٍ، ومن طار فوق جبل فإنه ينال ولاية أو عزة..."),
  Dream(title: "رؤية الصلاة في المنام", content: "أداء الصلاة في المنام يدل على قضاء الدين، أو أداء الأمانة، أو الوصول إلى غاية منشودة..."),
  Dream(title: "رؤية الخبز والطعام", content: "الخبز في المنام هو الإسلام لأنه قوام الروح، أو هو المال الحلال، ورؤية الخبز الأبيض تدل على عيش رغيد..."),
  Dream(title: "رؤية الأشجار والحدائق", content: "الأشجار تدل على الرجال أو النساء، والحديقة المثمرة تدل على العمل الصالح والبركة في الذرية..."),
];
