class ImamAliContent {
  final String title;
  final String content;
  ImamAliContent({required this.title, required this.content});
}
final List<ImamAliContent> imamAliList = [
  ImamAliContent(title: "نهج البلاغة - الخطبة الشقشقية", content: "أما والله لقد تقمصها فلان وإنه ليعلم أن محلي منها محل القطب من الرحى، ينحدر عني السيل ولا يرقى إلي الطير..."),
  ImamAliContent(title: "حكم ودرر علوية", content: "قال عليه السلام: الناس نيام فإذا ماتوا انتبهوا. وقال: قيمة كل امرئ ما يحسنه. وقال: ما أضمر أحد شيئاً إلا ظهر في فلتات لسانه وصفحات وجهه..."),
  ImamAliContent(title: "مناجاة أمير المؤمنين في مسجد الكوفة", content: "اللهم إني أسألك الأمان يوم لا ينفع مال ولا بنون إلا من أتى الله بقلب سليم، وأسألك الأمان يوم يعض الظالم على يديه..."),
  ImamAliContent(title: "وصية الإمام علي (ع) لابنه الحسن (ع)", content: "يا بني اجعل نفسك ميزاناً فيما بينك وبين غيرك، فأحبب لغيرك ما تحب لنفسك، واكره له ما تكره لها..."),
  ImamAliContent(title: "قصة الإمام علي (ع) مع السائل", content: "قصة تصدق الإمام علي (ع) بخاتمه وهو راكع في الصلاة، فنزلت في حقه الآية الكريمة: إنما وليكم الله ورسوله والذين آمنوا..."),
  ImamAliContent(title: "بطولات الإمام علي (ع) في خيبر", content: "فتح خيبر وقلع بابها العظيم، وقول النبي (ص): لأعطين الراية غداً رجلاً يحب الله ورسوله ويحبه الله ورسوله، كرار غير فرار..."),
];
