class Dhikr {
  final String title;
  final String content;

  Dhikr({required this.title, required this.content});
}

final List<Dhikr> shiaDuas = [
  Dhikr(title: "دعاء كميل", content: "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ..."),
  Dhikr(title: "دعاء التوسل", content: "اللَّهُمَّ إِنِّي أَسْأَلُكَ وَأَتَوَجَّهُ إِلَيْكَ بِنَبِيِّكَ نَبِيِّ الرَّحْمَةِ..."),
  Dhikr(title: "دعاء الندبة", content: "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَصَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ نَبِيِّهِ وَآلِهِ..."),
  Dhikr(title: "دعاء الصباح", content: "يَا مَنْ دَلَعَ لِسَانَ الصَّبَاحِ بِنُطْقِ تَبَلُّجِهِ..."),
  Dhikr(title: "دعاء العهد", content: "اللَّهُمَّ رَبَّ النُّورِ الْعَظِيمِ وَرَبَّ الْكُرْسِيِّ الرَّفِيعِ..."),
  Dhikr(title: "دعاء الجوشن الكبير", content: "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ يَا اللَّهُ يَا رَحْمَنُ يَا رَحِيمُ..."),
  Dhikr(title: "دعاء أبي حمزة الثمالي", content: "إِلَهِي لا تُؤَدِّبْنِي بِعُقُوبَتِكَ، وَلا تَمْكُرْ بِي فِي حِيلَتِكَ..."),
  Dhikr(title: "مناجاة المتوسلين", content: "إِلَهِي لَيْسَ لِي وَسِيلَةٌ إِلَيْكَ إِلاَّ عَواطِفُ رَأْفَتِكَ..."),
];

final List<Dhikr> shiaVisits = [
  Dhikr(title: "زيارة عاشوراء", content: "السَّلامُ عَلَيْكَ يَا أَبَا عَبْدِ اللَّهِ، السَّلامُ عَلَيْكَ يَا ابْنَ رَسُولِ اللَّهِ..."),
  Dhikr(title: "زيارة وارث", content: "السَّلامُ عَلَيْكَ يَا وَارِثَ آدَمَ صَفْوَةِ اللَّهِ..."),
  Dhikr(title: "الزيارة الجامعة الكبيرة", content: "السَّلامُ عَلَيْكُمْ يَا أَهْلَ بَيْتِ النُّبُوَّةِ..."),
  Dhikr(title: "زيارة أمين الله", content: "السَّلامُ عَلَيْكَ يَا أَمِينَ اللَّهِ فِي أَرْضِهِ..."),
  Dhikr(title: "زيارة آل يس", content: "سَلامٌ عَلَى آلِ يس، السَّلامُ عَلَيْكَ يَا دَاعِيَ اللَّهِ..."),
  Dhikr(title: "زيارة الإمام الرضا (ع)", content: "السَّلامُ عَلَيْكَ يَا وَلِيَّ اللَّهِ وَابْنَ وَلِيِّهِ..."),
  Dhikr(title: "زيارة السيدة زينب (ع)", content: "السَّلامُ عَلَيْكِ يَا بِنْتَ سَيِّدِ الأَنْBِيَاءِ..."),
];
