class Dhikr {
  final String title;
  final String content;
  final String type;

  Dhikr({required this.title, required this.content, required this.type});
}

final List<Dhikr> shiaDuas = [
  Dhikr(title: "دعاء كميل", content: "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ...", type: "dua"),
  Dhikr(title: "دعاء التوسل", content: "اللَّهُمَّ إِنِّي أَسْأَلُكَ وَأَتَوَجَّهُ إِلَيْكَ بِنَبِيِّكَ نَبِيِّ الرَّحْمَةِ...", type: "dua"),
  Dhikr(title: "دعاء الندبة", content: "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَصَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ نَبِيِّهِ وَآلِهِ...", type: "dua"),
  Dhikr(title: "دعاء الصباح", content: "يَا مَنْ دَلَعَ لِسَانَ الصَّبَاحِ بِنُطْقِ تَبَلُّجِهِ...", type: "dua"),
  Dhikr(title: "دعاء العهد", content: "اللَّهُمَّ رَبَّ النُّورِ الْعَظِيمِ وَرَبَّ الْكُرْسِيِّ الرَّفِيعِ...", type: "dua"),
];

final List<Dhikr> shiaVisits = [
  Dhikr(title: "زيارة عاشوراء", content: "السَّلامُ عَلَيْكَ يَا أَبَا عَبْدِ اللَّهِ، السَّلامُ عَلَيْكَ يَا ابْنَ رَسُولِ اللَّهِ...", type: "visit"),
  Dhikr(title: "زيارة وارث", content: "السَّلامُ عَلَيْكَ يَا وَارِثَ آدَمَ صَفْوَةِ اللَّهِ، السَّلامُ عَلَيْكَ يَا وَارِثَ نُوحٍ نَبِيِّ اللَّهِ...", type: "visit"),
  Dhikr(title: "الزيارة الجامعة الكبيرة", content: "السَّلامُ عَلَيْكُمْ يَا أَهْلَ بَيْتِ النُّبُوَّةِ، وَمَوْضِعَ الرِّسَالَةِ...", type: "visit"),
  Dhikr(title: "زيارة أمين الله", content: "السَّلامُ عَلَيْكَ يَا أَمِينَ اللَّهِ فِي أَرْضِهِ وَحُجَّتَهُ عَلَى عِبَادِهِ...", type: "visit"),
  Dhikr(title: "زيارة آل يس", content: "سَلامٌ عَلَى آلِ يس، السَّلامُ عَلَيْكَ يَا دَاعِيَ اللَّهِ وَرَبَّانِيَّ آيَاتِهِ...", type: "visit"),
];
